app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", "Lourence John"], ["lastname", "Cabaluna"], ["active", false], ["created_at", 2017-05-01 06:18:30 UTC], ["updated_at", 2017-05-01 06:18:30 UTC]]
---
  def create
    @user = users.build(user_params)#User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "active" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["active", true], ["updated_at", 2017-05-01 06:29:04 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)